{"config": [{"config": {"input_dtype": "float32", "mode": 0, "beta_regularizer": null, "name": "batchnormalization_1", "trainable": true, "gamma_regularizer": null, "batch_input_shape": [null, 40, 80, 3], "momentum": 0.99, "axis": -1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"nb_row": 3, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "nb_col": 3, "name": "convolution2d_1", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "bias": true, "nb_col": 3, "name": "convolution2d_2", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 16, "init": "glorot_uniform", "bias": true, "nb_col": 3, "name": "convolution2d_3", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 8, "init": "glorot_uniform", "bias": true, "nb_col": 3, "name": "convolution2d_4", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 128, "b_regularizer": null, "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 4608}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 64, "b_regularizer": null, "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 128}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 32, "b_regularizer": null, "activity_regularizer": null, "name": "dense_3", "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 64}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "b_regularizer": null, "activity_regularizer": null, "name": "dense_4", "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 32}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}