{"config": [{"config": {"trainable": true, "momentum": 0.99, "mode": 0, "batch_input_shape": [null, 40, 80, 3], "axis": -1, "input_dtype": "float32", "epsilon": 0.001, "name": "batchnormalization_1", "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"nb_row": 3, "bias": true, "W_constraint": null, "activation": "linear", "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "name": "convolution2d_1", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "bias": true, "W_constraint": null, "activation": "linear", "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 32, "activity_regularizer": null, "name": "convolution2d_2", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "bias": true, "W_constraint": null, "activation": "linear", "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 16, "activity_regularizer": null, "name": "convolution2d_3", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "bias": true, "W_constraint": null, "activation": "linear", "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 8, "activity_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": 4608, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "output_dim": 128, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": 128, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "output_dim": 64, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": 64, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3", "output_dim": 32, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": 32, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_4", "output_dim": 1, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}